
list = [[],
       ["табацкая","сухонис","табацька","сухоніс" ],
       ["ткач"],
       ["малихіна"],
       ["нікітін","никитин","нікитін"],
       ['глущенко','Антон'],
       ["шевченко"],
       ['олеся','антошкина'],
       ['безуглий'],
       ['бездільний','ігор'],
       ['фурдуй'],
       ['тарасов'],
       ['тейлор'],
       ['скрипніченко'],
       ['ніколайчук']]



types = [[],
         ['cюжет','сюж'],
         ['shorts','шортс'],
         ['історії війни'],
         ['подкаст доречі','подкаст','доречі','підкаст'],
         ['соціальне опитування','соц'],
         ['дайджест','дайдж'],
         ['комунальний патруль','ком','комуналка'],
         ['інтервю','інт','инт','интервю'],
         ['шоу'],
         ['скайп'],
         ['чс','прилёт','прилет']]


# ('Сюжет'), --1
# ('Shorts'), --2
# ('Історії Війни'), --3
# ('Подкаст ДОречі'), -- 4
# ('Соціальне опитування'), -- 5
# ('Дайджест'), -- 6
# ('Комунальний патруль'), -- 7
# ('Інтервю'), -- 8
# ('Шоу'), -- 9
# ('Скайп'), --10
# ('ЧС'); -- 11



def getId(name):
    for i in list:
        for j in i:
            if j == name.lower():
                return list.index(i)


def getIdType(name):
    for i in types:
        for j in i:
            if j == name.lower():
                return types.index(i)


# print(getIdType("dfgef"))
# for i in types:
#     for j in i:
#         print(j)
#         print(getIdType(j.lower()))
#         print(getIdType(j.upper()))

# ('Дарина Сухоніс'), --1
# ('Анастасія Ткач'),	--2
# ('Валерія Малихіна'),	--3
# ('Андрій Нікітін'), --4
# ('Антон Глущенко'), --5
#
# ('Елена Шевченко'), --6
# ('Олеся Антошкина'), --7
# ('Олексій Безуглий'),--8
#
# ('Ігор Бездільний'),--9
# ('Костянтин Фурдуй'),--10
# ('Евгеній Тарасов'),--11
# ('Максим Тейлор'), --12
# ('Скрипніченко Микита'), --13
#
# ('Аріна Ніколайчук');--14





# print(list)



if __name__ == '__main__':
    None